## ✅ Foundation Terraform Plan

**Status**: Plan generated successfully
**Total changes**: 95 lines

### Plan Preview (first 50 lines)
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.null_resource.validate_caf_naming will be created
  + resource "null_resource" "validate_caf_naming" {
      + id = (known after apply)
    }

  # module.foundation.azurerm_management_group.a10corp will be created
  + resource "azurerm_management_group" "a10corp" {
      + display_name               = "mg-a10corp-hq"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (sensitive value)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.foundation.azurerm_management_group.sales will be created
  + resource "azurerm_management_group" "sales" {
      + display_name               = "mg-a10corp-sales"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.foundation.azurerm_management_group.service will be created
  + resource "azurerm_management_group" "service" {
      + display_name               = "mg-a10corp-service"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.foundation.azurerm_management_group.shared will be created
  + resource "azurerm_management_group" "shared" {
      + display_name               = "mg-a10corp-shared"
      + id                         = (known after apply)
      + name                       = (known after apply)
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)

... (truncated, see full plan in Azure Storage)

```

### 📋 Full Plan Available
- **Azure Storage**: [View full plan in Azure Portal](https://portal.azure.com/#view/Microsoft_Azure_Storage/BlobPropertiesBladeV2/storageAccountId/%2Fsubscriptions%2Ffdb297a9-2ece-469c-808d-a8227259f6e8%2FresourceGroups%2Frg-root-iac%2Fproviders%2FMicrosoft.Storage%2FstorageAccounts%2Fstorerootblob/path/foundation%2Fplans/foundation-TIMESTAMP-13.txt)
- **Container**: `storerootblob/foundation`
- **Path**: `plans/foundation-TIMESTAMP-13.txt`

### Next Steps
1. Review the plan above or download from Azure Storage
2. Approve this workflow run to proceed with apply
3. The exact plan shown will be applied (no changes)
